package cn.zhuqi.system;

public enum EActivity {
	GCSL("工程受理"), 
	SZZSH("市场及大客户服务部专责审核"), 
	SZRSH("市场及大客户服务部主任审核"), 
	YZZSH("营销部专责审核"), 
	YZRSH("营销部主管主任审核"),
	FZSH("公司分管营销部副总经理审核"),
	SZZFID("分配工程编号"),
	QDXY("签订协议"),
	GDFA("制定临时和正式供电供电方案"),
	LLXSQ("临时用电工程立项申请"),
	YZZLLXSQ("向省公司上报临时用电工程立项申请"),
	LLXSQPF("接收省公司批复临时用电工程立项申请"),
	LSJJL("组织临时用电工程设计|监理竞争性谈判"),
	LSJ("委托临时用电工程设计监理工作"),
	LSGTP("组织临时用电施工竞争性谈判"),
	LSGHT("签订临时用电施工合同"),
	LYS("临时用电工程验收"),
	LJS("临时用电工程结算"),
	LJL("临时用电监理报告归档"),
	ZKYXG("向设计院移交正式用电可研相关材料"),
	ZKY("正式用电可研文件编制完成申请审核"),
	YZZKY("组织可研文件审核"),
	ZLX("正式用电工程立项"),
	ZLXPF("批复正式用电工程立项"),
	ZSJJL("组织正式用电工程设计|监理招标"),
	ZSJ("正式用电工程设计"),
	ZSGZB("组织正式用电工程施工招标"),
	ZSGHT("签订正式用电工程施工合同"),
	ZJD30("正式用电30%进度"),
	ZJD60("正式用电60%进度"),
	ZJD100("正式用电100%进度"),
	ZYS("正式用电工程验收"),
	ZJS("正式用电工程结算"),
	PTF20("收取20%配套费"),
	CWLLX("财务临时工程立项"),
	CWZLX("财务正式工程立项"),
	LSJJLJK("办理临时用电工程设计|监理借款"),
	LJK95("办理临时用电工程施工95%借款"),
	LJK5("办理临时用电工程5%质保金"),
	PTF50("收取50%配套费"),
	ZHTJE("确认正式用电施工中标合同金额"),
	JK30("第一次借款"),
	JK60("第二次借款"),
	JK80("第三次借款"),
	PTF30("收取30%配套费"),
	CWJS("财务结算"),
	JK15("第四次借款"),
	ZJKQT("正式用电其他费用借款"),
	ZSJJLJK("正式用电工程设计|监理借款"),
	SGJK5("正式用电工程施工质保金");
	
	
	private final String name;

	private EActivity(String name) {
		this.name = name;
	}

	public String getName() {
		return name;
	}
}
